code-review/NRB_3471_3546/База_Стало/DataProcessors/ОбработкаОперацийПоОбслуживаниюЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаОперацийПоОбслуживаниюЦБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСНачалаВремен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦБ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНачальныйОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПриход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРасход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Снятие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЗагрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ОбработкаОперацийПоОбслуживаниюЦБ/Ext/ManagerModule.bsl
// Выполняет поиск ЦБ с закрытым кодом загрузки и создаёт для них операции снятия с обслуживания.
// Документы создаются датой закрытия кода загрузки.
//
// Параметры:
//  ДатаНачала		 - Дата	 - Начало периода поиска.
//  ДатаОкончания	 - Дата	 - Окончание периода поиска.
//
Процедура ВыполнитьСнятиеЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	ОбработкаОперацииПоОбслуживаниюЦБ = Обработки.ОбработкаОперацийПоОбслуживаниюЦБ.Создать();
	ОбработкаОперацииПоОбслуживаниюЦБ.ПериодНачало = ДатаНачала;
	ОбработкаОперацииПоОбслуживаниюЦБ.ПериодКонец = ДатаОкончания;
	
	ОбработкаОперацииПоОбслуживаниюЦБ.ОтобратьЦенныеБумаги(Ложь, Истина);
	ОбработкаОперацииПоОбслуживаниюЦБ.СоздатьПоручения(Ложь, Истина);
КонецПроцедуры

// Выполняет поиск неснятых ЦБ с закрытым кодом загрузки или погашенных облигаций/паев и отправляет уведомление почтой.
//
// Параметры:
//  ДатаНачала		 - Дата	 - Начало периода контроля.
//  ДатаОкончания	 - Дата	 - Окончание периода контроля.
//
Процедура ВыполнитьКонтрольЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	ОбработкаОперацииПоОбслуживаниюЦБ = Обработки.ОбработкаОперацийПоОбслуживаниюЦБ.Создать();
	ОбработкаОперацииПоОбслуживаниюЦБ.ПериодНачало = ДатаНачала;
	ОбработкаОперацииПоОбслуживаниюЦБ.ПериодКонец = ДатаОкончания;
	ОбработкаОперацииПоОбслуживаниюЦБ.ВыполнитьКонтроль();
КонецПроцедуры
